{
  "meta": {"theme": "jsonresume-theme-even"},
  "basics": {
    "name": "Brian Dorton",
    "label": "Full Stack Developer",
    "picture": "https://avatars1.githubusercontent.com/u/662645?v=4&s=460",
    "email": "brian@dorton.co",
    "phone": "(713) 922-5440",
    "url": "http://dorton.co",
    "summary": "I specialize in developing and implementing technology solutions that drive business growth and operational efficiency. From creating a fully custom sales recommendation engine with a team of only 5 for IBM to automating data collection and building custom reporting tools, my focus is on delivering scalable, impactful results. With expertise in integrating systems like SalesForce and implementing modern CI tools, I thrive in leading development initiatives that align with company objectives and foster continuous innovation.",
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "brian-dorton",
        "url": "https://www.linkedin.com/in/brian-dorton"
      },
      {
        "network": "Github",
        "username": "dorton",
        "url": "github.com/dorton"
      },
      {
        "network": "Twitter",
        "username": "badorton",
        "url": "https://twitter.com/badorton"
      }
    ]
  },
  "skills": [
    {
      "name": "Front End",
      "level": "Senior",
      "keywords": [
        "Javascript",
        "Vue",
        "React",
        "HTML/JSX",
        "CSS"
      ]
    },
    {
      "name": "Back End",
      "level": "Mid",
      "keywords": [
        "Node",
        "Ruby",
        "Rails",
        "Python",
        "Django",
        "PHP",
        "Laravel",
        "Postgres",
        "Redis"
      ]
    },
    {
      "name": "Devops",
      "level": "Mid",
      "keywords": [
        "Docker",
        "Kubernetes",
        "Containerization",
        "IBM Cloud",
        "AWS",
        "Agile",
        "CI/CD"
      ]
    }
  ],
  "work": [
    {
      "name": "IBM",
      "company": "IBM",
      "position": "Full Stack Developer, Sales Systems Architect",
      "website": "http://ibm.com",
      "startDate": "2017-11-01",
      "summary": "Supported a large sales team through building custom applications that streamline processes and automate the collection of data.",
      "highlights": [
        "Built sales recommendation engine launched in 2023-2H with 4800 recommendations reviewed by reps, generating $7.8M in additional pipeline with $1.7M closed Won.",
        "Automated data collection and created custom tools for metrics and reporting for a department responsible for for over $50M in revenue.",
        "Implemented modern CI tooling to update and deploy applications on IBM's Cirrus Cloud network.",
        "Tightly integrated data collected from sales reps with SalesForce data through SalefForce Api interface and building custom SalesForce Lightning applications."
      ]
    },
    {
      "name": "The Iron Yard",
      "company": "The Iron Yard",
      "position": "Lead Campus Director",
      "website": "http://theironyard.com",
      "startDate": "2014-9-01",
      "endDate": "2017-10-31",
      "summary": "Running operations at The Iron Yard Academy's three-month intensive code schools personally focused on the Houston campus.",
      "highlights": [
        "Lead and contribute to company-wide initiatives that are aligned to The Iron Yard Mission and Vision",
        "Support and manage a region of 6 campuses",
        "Support campus level decisions ranging from student concerns to budget questions",
        "Administer performance reviews"
      ]
    },
    {
      "name": "dorton.co",
      "company": "dorton.co",
      "position": "Freelance Web Developer",
      "website": "http://dorton.co",
      "startDate": "2011-9-01",
      "summary": "Develop applications for both clients and internal applications for companies.",
      "highlights": [
        "DocDel: Developed fullstack MVP for document and rights management for entertainment law firm",
        "CarRiders: Developed application for an efficient, safer alternative to school dismissal. Currently in place at 3 campuses",
        "TIY Event Signin: Developed an event signin app that helps you glean patterns and data from attendees of your events. Currently used nationally at The Iron Yard"
      ]
    },
    {
      "name": "Houston Independent School District",
      "company": "Houston Independent School District",
      "position": "Campus Administrator",
      "website": "http://houstonisd.org",
      "startDate": "2011-8-01",
      "endDate": "2014-8-30",
      "summary": "",
      "highlights": [
        "Disaggregate and disseminate grade level common assessment data and district level assessment data as collected through the EdPlan system. Assist grade level teams in spotting trends using the data and designing interventions to address any gaps.",
        "Ensure campus computers/mobile devices are maintained and running. Design and deliver technology professional development sessions to staff and beginning computer classes to parents. Oversee all campus technology initiatives."
      ]
    },
    {
      "name": "Houston Independent School District",
      "company": "Houston Independent School District",
      "position": "District Curriculum Specialist - Education Technology",
      "website": "http://houstonisd.org",
      "startDate": "2008-8-01",
      "endDate": "2011-8-01",
      "summary": "Support technology integration for one of the largest school districts in the US.",
      "highlights": [
        "Lead over 100 hours of trainings for teachers across the district on the technology integration.",
        "Support campus level decisions ranging from student concerns to budget questions",
        "Administer performance reviews"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Houston-Clear Lake",
      "area": "Masters Educational Management",
      "studyType": "Master of Science",
      "startDate": "2010-05-01",
      "endDate": "2012-05-01"
    },
    {
      "institution": "Texas A&M University",
      "area": "Biomedical Science",
      "studyType": "Bachelor of Science",
      "startDate": "1996-08-01",
      "endDate": "2000-12-01"
    }
  ],
  "references": [
    {
      "name": "Mary Bentley",
      "reference": "I have worked with Brian for about two years now. We worked a on building and inference engine for sales automation in Salesforce. Brian was critical to the success of the project. His work ethic is second to none and his knowledge of the back end processes is remarkable. The project couldn't have happened without him."
    },
    {
      "name": "Jessica Mitsch",
      "reference": "Brian lights up any room he walks into. He was the founding Campus Director for The Iron Yard Houston and built an incredible community over the years that only someone with his kind of heartfelt passion, kindness and care could do. You’re a lucky person if you have the privilege to work with Brian!"
    }
  ]
}
